angular.module('gb.order.constants',[])
    .constant('orderConstants', {
        //-- 订单状态
        'statuses': {
            '10': "已提交",
            '20': "已支付",
            '50': "备货中",
            '60': "已发货",
            '70': "已签收",
            '120': "已取消"
        },
        //-- 销售渠道
        'channels': {
            '1': "飞飞商城",
            '2': "天猫商城",
            '3': "善融商城",
            '4': "线下销售",
            '5': "天猫家居专营店_日用品",
            '6': "天猫家居用品专营店_家具",
            '7': "天猫电器专营店",
            '8': "Global Sale",
            '9': "飞飞Web商城",
            '10': "飞飞手机商城",
            '11': "天猫淘宝店",
            '12': "360商城",
            '13': "360",
            '14': "善融商城",
            '15': "Globalmarket"
        },
        //-- 监控状态
        'healthStatuses': {
            '0': "正常",
            '1': "异常"
        },
        //-- 货币
        'currencies': {
            '1': "CNY",  //人民币
            '2': "HKD",  //港币
            '3': "EUR",  //欧元
            '4': "USD",  //美元
            '5': "GBP"  //英镑
        },
        'currencyIcons': {
            '1': "fa-rmb",  //人民币
            '2': "HKD",  //港币
            '3': "fa-eur",  //欧元
            '4': "fa-usd",  //美元
            '5': "fa-gbp"  //英镑
        },
        //-- 发货类型
        'shippingTypes': {
            '1': "飞飞",
            '2': "厂家直发"
        },
        //-- 订单类型
        'orderTypes': {
            '1': "普通订单",
            '2': "RMA订单"
        },
        //-- 支付状态
        'paymentStatuses': {
            '10': "未付款",
            '20': "部分付款",
            '30': "已付款"
        },
        //-- 支付事务类型
        'paymentTransactionTypes': {
            '1': "支付",
            '2': "退款"
        },
        //-- 运输类型
        'shippingMethods': {
            'zwt': "自委托",
            'shipping': "海运",
            'land': "陆运",
            'air': "空运"
        },
        //-- 运输状态
        'shippingStatuses': {
            '10': "未处理",
            '30': "已扣减库存",
            '40': "已下发到仓库",
            '50': "仓库已确认",
            '60': "已发货",
            '70': "已收货",
            '80': "已取消",
            '90': "仓库异常"
        }
    });
